app/Controllers/Admin/DashboardController.php

SELECT DATE_FORMAT(tanggal, '%Y-%u') as minggu, COUNT(*) as total
FROM `logbook`
GROUP BY `minggu`
ORDER BY `minggu` ASC
 LIMIT 8
SELECT `status`, COUNT(*) as total
FROM `laporan`
GROUP BY `status`
SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
SELECT COUNT(*) AS `numrows`
FROM `dpl`
SELECT COUNT(*) AS `numrows`
FROM `lokasi_kkn`
SELECT COUNT(*) AS `numrows`
FROM `kelompok_kkn`
SELECT COUNT(*) AS `numrows`
FROM `logbook`
SELECT COUNT(*) AS `numrows`
FROM `laporan`
---
    public function index()
    {
        $mahasiswaModel = model(MahasiswaModel::class);
        $dplModel       = model(DplModel::class);
        $lokasiModel    = model(LokasiKknModel::class);
        $logbookModel   = model(LogbookModel::class);
        $laporanModel   = model(LaporanModel::class);

        $logbookPerMinggu = $logbookModel->select("DATE_FORMAT(tanggal, '%Y-%u') as minggu, COUNT(*) as total")
            ->groupBy('minggu')
            ->orderBy('minggu', 'ASC')
            ->findAll(8);

        $laporanStatus = $laporanModel->select('status, COUNT(*) as total')
            ->groupBy('status')
            ->findAll();

        return $this->render('admin/dashboard', [
            'title'            => 'Dashboard Admin',
            'totalMahasiswa'   => $mahasiswaModel->countAllResults(),
            'totalDpl'         => $dplModel->countAllResults(),
            'totalLokasi'      => $lokasiModel->countAllResults(),
            'totalKelompok'    => model(KelompokKknModel::class)->countAllResults(),
            'totalLogbook'     => $logbookModel->countAllResults(),
            'totalLaporan'     => $laporanModel->countAllResults(),
            'mahasiswaTerbaru' => $mahasiswaModel->getLatest(),
            'logbookPerMinggu' => $logbookPerMinggu,
            'laporanStatus'    => $laporanStatus,
            'petaKelompok'     => model(KelompokKknModel::class)->getWithGps(),
        ]);