app/Models/LogbookModel.php

SELECT *
FROM `logbook`
WHERE `mahasiswa_id` = 1
ORDER BY `tanggal` DESC
---
    public function getByMahasiswa(int $mahasiswaId): array
    {
        return $this->where('mahasiswa_id', $mahasiswaId)
            ->orderBy('tanggal', 'DESC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `logbook`
WHERE `mahasiswa_id` = 1
AND `status` = 'divalidasi'
---
    public function countByMahasiswaStatus(int $mahasiswaId, string $status): int
    {
        return $this->where('mahasiswa_id', $mahasiswaId)->where('status', $status)->countAllResults();